---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetSpatialFieldManager(Autodesk.Revit.DB.View)
source: html/e95e5966-8893-6a45-5cb3-ebba044b9be8.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetSpatialFieldManager Method

Retrieves manager object for the given view or returns NULL

## Syntax (C#)
```csharp
public static SpatialFieldManager GetSpatialFieldManager(
	View view
)
```

## Parameters
- **view** (`Autodesk.Revit.DB.View`) - View for which manager object is retrieved

## Returns
Manager object for the view passed in the argument